04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/reverseBurner/constant/gas/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Westbrook, C. K., & Dryer, F. L. (1981).
    Simplified reaction mechanisms for the oxidation of hydrocarbon fuels in
    flames.
    Combustion science and technology, 27(1-2), 31-43.

Notes:
    The mechanism used is set 3 from table 2. This should be the most accurate
    single-step methane mechanism without any negative exponents. Set 2 is not
    usable because the negative exponent on the methane concentration causes
    divergence in regions without any fuel.

\*---------------------------------------------------------------------------*/

reactions
{
    methaneReaction
    {
        type    irreversibleArrhenius;
        reaction "CH4^0.2 + 2O2^1.3 = CO2 + 2H2O";
        A       6.7e12 [(mol/cm^3)^-0.5/s];
        beta    0;
        Ea      48.4 [kcal/mol];
    }
}

Tlow    200;
Thigh   5000;

// ************************************************************************* //
