04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/reverseBurner/constant/solid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         zonalMixture;
    transport       constIsoSolid;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

zones
(
    inner
    middle
    outer
);

inner
{
    specie
    {
        molWeight       55.845;
    }
    equationOfState
    {
        rho             7874;
    }
    thermodynamics
    {
        hf              0;
        Cv              449.458;
    }
    transport
    {
        kappa           80.4;
    }
}

middle
{
    specie
    {
        molWeight       63.546;
    }
    equationOfState
    {
        rho             8935;
    }
    thermodynamics
    {
        hf              0;
        Cv              384.603;
    }
    transport
    {
        kappa           401;
    }
}

outer
{
    specie
    {
        molWeight       26.982;
    }
    equationOfState
    {
        rho             2699;
    }
    thermodynamics
    {
        hf              0;
        Cv              896.894;
    }
    transport
    {
        kappa           237;
    }
}

// ************************************************************************* //
